cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H747I_eval_QSPI/QSPI/STM32H747I_QSPI.c
/**
  ******************************************************************************
  * @file    STM32H747I_QSPI.c
  * @author  MCD Application Team
  * @brief   This file defines the operations of the external loader for
  *          MT25TL01G QSPI memory of STM32H747I-EVAL.
  *           
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */


#include "STM32H747I_QSPI.h"


QSPI_HandleTypeDef QSPIHandle;
QSPI_Info QspiInfo;
QSPI_CommandTypeDef s_command;
QSPI_MemoryMappedTypeDef s_mem_mapped_cfg;
QSPI_AutoPollingTypeDef s_config;

 HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{ 
  return HAL_OK;
}
/**
  * @brief  System initialization.
  * @param  None
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */
int Init_QSPI()
{ 
  /* Zero Init structs */
	  memset(&QSPIHandle,0,sizeof(QSPIHandle));
  memset(&s_command,0,sizeof(s_command));
  memset(&s_mem_mapped_cfg,0,sizeof(s_mem_mapped_cfg));
  memset(&s_config,0,sizeof(s_config));
  memset(&QspiInfo,0,sizeof(QspiInfo));
	
     SystemInit(); 
  /* Configure the system clock to 80 MHz */
  SystemClock_Config();
/*Initialaize QSPI*/
  if(BSP_QSPI_Init() !=0)
    return 0;
	/*Configure the QSPI in memory-mapped mode*/
  if(BSP_QSPI_EnableMemoryMappedMode()!=0)
    return 3;
  
   return 1;
}
/**
  * @brief   erase memory.
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */

 int MassErase (){
	 /*Initialaize QSPI*/
  BSP_QSPI_DeInit();  
  BSP_QSPI_Init();
  /* Erases the entire QSPI memory*/
  BSP_QSPI_Erase_Chip();
  /*Reads current status of the QSPI memory*/
  while (BSP_QSPI_GetStatus()!=QSPI_OK){}; 
	 
	return 1;
}
/**
  * @brief   Program memory.
  * @param   Address: page address
  * @param   Size   : size of data
  * @param   buffer : pointer to data buffer
  * @retval  1      : Operation succeeded
  * @retval  0      : Operation failed
  */

 int Write (uint32_t Address, uint32_t Size, uint8_t* buffer)
{

    Address = Address & 0x0fffffff;
    /*Initialaize QSPI*/
	  BSP_QSPI_DeInit();
    BSP_QSPI_Init();
   /*Writes data to the QSPI memory*/
  	BSP_QSPI_Write(buffer,Address, Size);
  
   return 1;
}


/**
  * @brief   Sector erase.
  * @param   EraseStartAddress :  erase start address
  * @param   EraseEndAddress   :  erase end address
  * @retval  None
  */
 int SectorErase (uint32_t EraseStartAddress ,uint32_t EraseEndAddress)
{
  uint32_t BlockAddr;
  EraseStartAddress&=0x0FFFFFFF;
  EraseEndAddress &=0x0FFFFFFF;
  EraseStartAddress = EraseStartAddress -  EraseStartAddress % 0x20000;
  /*Initialaize QSPI*/
	BSP_QSPI_DeInit();
  BSP_QSPI_Init();
  while (EraseEndAddress>=EraseStartAddress)
  {
    BlockAddr = EraseStartAddress;
    /*Erases the specified block of the QSPI memory*/
		BSP_QSPI_Erase_Block(BlockAddr);
    /*Reads current status of the QSPI memory*/
    while (BSP_QSPI_GetStatus()!=QSPI_OK){};
      
		EraseStartAddress+=0x20000;
  }
  /*Configure the QSPI in memory-mapped mode*/
	BSP_QSPI_EnableMemoryMappedMode();
  
	return 1;	
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 400000000 (Cortex-M7 CPU Clock)
  *            HCLK(Hz)                       = 200000000 (Cortex-M4 CPU, Bus matrix Clocks)
  *            AHB Prescaler                  = 2
  *            D1 APB3 Prescaler              = 2 (APB3 Clock  100MHz)
  *            D2 APB1 Prescaler              = 2 (APB1 Clock  100MHz)
  *            D2 APB2 Prescaler              = 2 (APB2 Clock  100MHz)
  *            D3 APB4 Prescaler              = 2 (APB4 Clock  100MHz)
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 5
  *            PLL_N                          = 160
  *            PLL_P                          = 2
  *            PLL_Q                          = 4
  *            PLL_R                          = 2
  *            VDD(V)                         = 3.3
  *            Flash Latency(WS)              = 4
  * @param  None
  * @retval None
  */
static int SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;
  
  /*!< Supply configuration update enable */
  HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);

  /* The voltage scaling allows optimizing the power consumption when the device is
     clocked below the maximum system frequency, to update the voltage scaling value
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.CSIState = RCC_CSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;

  RCC_OscInitStruct.PLL.PLLM = 5;
  RCC_OscInitStruct.PLL.PLLN = 160;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLQ = 4;

  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_2;
  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if(ret != HAL_OK)
  {
    return 0;
  }
  
